if answ[1] == 'расп':
	if len(answ) > 2:
		if answ[2] == "1":
			apisay('Понедельник:<br><br>1)Нет пары/История(618)<br>-------------------------<br>2)Информатика(На 3 этаже)<br>-------------------------<br>3)Иностранный яз(714/515)/Нет пары',toho,torep)
		if answ[2]=="2":
			apisay('Вторник:<br><br>1)Нет пары<br>-------------------------<br>2)Иностранный яз(714/515)<br>-------------------------<br>3)Физ-ра(С/з)<br>-------------------------<br>4)Физика(601)/Нет пары',toho,torep)
		if answ[2]=="3":
			apisay('Среда:<br><br>1)История(618)<br>-------------------------<br>2)Математика(713)<br>-------------------------<br>3)Русский Язык(710)<br>-------------------------<br>4)Обществознание(715)/Литература(710)',toho,torep)
		if answ[2]=="4":
			apisay('Четверг:<br><br>1)Физика(601)<br>-------------------------<br>2)Экология(608)<br>-------------------------<br>3)Химия(601)',toho,torep)
		if answ[2]=="5":
			apisay('Пятница:<br><br>1)Математика(713)<br>-------------------------<br>2)ОБЖ(712[или в 706])<br>-------------------------<br>3)Информатика(710)<br>-------------------------<br>4)Физ-ра(С/з)/Нет пары',toho,torep)
		if answ[2]=="6":
			apisay('Суббота:<br><br>1)Обществознание(715)<br>-------------------------<br>2)Литература(710)<br>-------------------------<br>3)Математика(713)',toho,torep)
		if answ[2]=="7":
			apisay('Я тебе лично разрешаю учиться в воскресенье',toho,torep)
	else:
		apisay('Вы забыли указать нужный параметр',toho,torep)
